Revit 2026 API

# DocumentGetProjectId Method

---

Gets ForgeDM project id where the model locates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetProjectId()
```
```vb
Public Function GetProjectId As String
```
```cpp
public:
String^ GetProjectId()
```
```fsharp
member GetProjectId : unit -> string
```

#### Return Value

String

| Exception | Condition |
| --- | --- |
| RevitServerUnauthorizedException | Thrown when cannot get data from ForgeDM for Revit cloud model. |

It is empty for non-cloud model; It is cached in Revit model opened session after getting it;

#### Reference

Document Class

Autodesk.Revit.DB Namespace